import {
    Flex,
    Container,
    Heading,
    Stack,
    Text,
    Button,
    Icon,
    IconProps,
    Grid,
    GridItem,
    Box,
    Spacer,
    Image,
    Badge,
    ListItem,
    OrderedList,
} from "@chakra-ui/react"

export default function chapter1() {
    return (
        <Container maxW={"9xl"}>
            <Stack textAlign={"center"} align={"center"} spacing={{ base: 8, md: 10 }} py={{ base: 20, md: 28 }}>
                <Heading fontWeight={600} fontSize={{ base: "2xl", sm: "3xl", md: "4xl" }} lineHeight={"110%"}>
                    บทที่ 5 โปรโทคอล
                </Heading>
            </Stack>
            <Text fontSize={{ base: "3xl", sm: "1.5xl", md: "3xl" }} lineHeight={"110%"} color="black">
                5.1 องค์กรในการกำหนดมาตรฐานในการพัฒนาระบบเครือข่าย
            </Text>
            <Box gap={6} p={12}>
                <Text fontSize={"3xl"} color="#251B37">
                    มาตรฐานด้านเครือข่ายต้องการให้ผู้ใช้สามารถเลือกซื้อผลิตภัณฑ์จากผู้ผลิตที่หลากหลาย เพื่อให้ผู้ผฺลิตผลิตภัณฑ์
                    ให้เป็นไปตามรายละเอียดหรือข้อกำหนดของมาตรฐาน ซึ่งผู้ใช้สามารถนำไปใช้งานร่วมกับอุปกรณ์คอมพิวเตอร์ได้
                    จึงมีองค์กรในการกำหนดมาตรฐานในการพัฒนาระบบเครือข่าย ได้แก่
                </Text>
                <Box gap={6} p={12}></Box>
                <Heading p={6}>5.1.1 ไอโซ (International Organization for Standardization : ISO)</Heading>
                <Text fontSize={"3xl"} color="#251B37">
                    เป็นมาตรฐานอุตสาหกรรมก่อตั้งเมื่อ ค.ศ. 1946 โดยองค์การระหว่างประเทศว่าด้วยมาตรฐาน ในปัจจุบันมีมากกว่า 12,000
                    มาตรฐานเป็นมาตรฐานที่ใช้บรรจุไว้มากกว่า 82 อุตสาหกรรมนานาชาติ
                    วัตุประสงค์เพื่อสนับสนุนการกำหนดมาตรฐานระหว่างชาติโดยสมาชิกสามารถตั้งข้อเสนอจากนั้นไอโซจะทำหน้าที่นำข้อเสนอเข้าสู้กระบวนการ
                    เพื่อหาข้อสรุปให้เป็นมาตรฐานสากล สำหรับมาตรฐานด้านเทคโนโลยีสารสนเทศทางไอโซมีการกำหนดมาตรฐานระบบเปิด (Open System Interconnection)
                    เรียกว่า แบบจำลองโอเอสไอ
                </Text>
                <Heading>5.1.2 ไอทียูที (International Telecommunications Union – Telecommunication Standardization Sector : ITU - T)</Heading>
                <Text fontSize={"3xl"} color="#251B37">
                    เป็นองค์กรกำหนดมาตรฐานด้านการสื่อสารโทรคมนาคม มีหน้าที่ให้คำปรึกษาทางเทคนิคเกี่ยวกับโทรศัพท์ โทรเลข และอุปกรณ์สื่อสาร
                    โดยศึกษาด้านเทคนิคและการปฏิบัติงาน เดิมรู้จักในนามซีซีไอทีที (Consultative Committee for International Telephone and Telegraph :
                    CCITT) ก่อตั้งเมื่อ ค.ศ. 1970 หลังจาก ค.ศ. 1993 ได้เปลี่ยนมาเป็นไอทียูที โดยมาตรฐานที่พัฒนาขึ้นและได้รับความนิยมอย่างสูงมากในยุโรป
                    เช่น CCITT X.25 หรือ X Series เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#251B37" p={6}>
                    5.1.3 แอนซี (American National Standards Institute : ANSI)
                </Heading>
                <Text fontSize={"3xl"} color="#251B37">
                    เป็นสถาบันมาตรฐานแห่งชาติของสหรัฐอเมริกา จัดตั้งโดยไม่แสวงหาผลกำไรทางธุรกิจ ทำหน้าที่ประสานงานระหว่างองค์กรกำหนดมาตรฐานอื่น ๆ
                    โดยสมาชิกมาจากหลายส่วนด้วยกัน เช่นหน่วยงานของรัฐบาล หน่วยงานด้านการศึกษา หน่วยงานวิจัยภาคอุตสาหกรรมและผู้บริโภค
                    โดยจะทำหน้าที่วิเคราะห์เพื่อหาข้อสรุปและกำหนดให้เป็นมาตรฐานใหม่ ตัวอย่างผลงาน เช่นANSI – COBOL ANSI – C
                    มาตรฐานการสื่อสารเครือข่ายแบบ FDDI เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#251B37">
                    5.1.4 ไอทริพเพิลอี (Institute of Electrical and Electronics Engineers : IEEE)
                </Heading>
                <Text fontSize={"3xl"} color="#251B37" p={6}>
                    เป็นองค์กรขนาดใหญ่ที่มีความเชี่ยวชาญด้านวิศวกรรม มีหน้าที่กำหนดมาตรฐานการสื่อสาร โดยมุ่งหมายในการกำหนดทฤษฎี การสร้าง
                    และตัวผลิตภัณฑ์ที่มีคุณภาพทางวิศวกรรมอิเล็กทรอนิกส์ เพื่อนำมาใช้เป็นซอฟต์แวร์และอุปกรณ์ชั้นกายภาพ (Physical Layer)
                    และชั้นเชื่อมข้อมูล (Data Link Layer) โดยมาตรฐานสำคัญ เช่น มาตรฐานเครือข่ายแลน เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#251B37" p={6}>
                    5.1.5 อีไอเอ (Electronics Industries Association : EIA)
                </Heading>
                <Text fontSize={"3xl"} color="#251B37">
                    องค์กรไม่แสวงหาผลกำรทางธุรกิจ มีหน้าที่กำหนดมาตรฐานสำหรับวงจรไฟฟ้า ทั้งรูปแบบการเชื่อมต่อหรืออินเตอร์เฟรช
                    รายละเอียดสัญญาณที่ใช้ในการสื่อสาร ขนาดแรงดันไฟฟ้า ตัวอย่างมาตรฐานที่อีไอเอกำหนด เช่น RS – 232
                    เป็นการสื่อสารแบบอนุกรมเพื่อใช้ติดต่อระหว่างสองอุปกรณ์ เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#251B37" p={6}>
                    5.2 แบบจำลองโอเอสไอ
                </Heading>
                <Text fontSize={"3xl"} color="#251B37">
                    แบบจำลองโอเอสไอดังรูป 5.1 เป็นแบบมาตรฐานที่พัฒนาและกำหนดโดยองค์กร ISO เป็นองค์กรที่ออกแบบโทรโทคอล OSI
                    หรือโปรโทคอลเชื่อมต่อเครือข่ายแบบเปิดเรียกว่าแบบจำลอง OSI ซึ่งไม่ได้ถูกใช้งานเหมือนชุดโปรโทคอลอื่น ๆ
                    แต่เนื่องจากเป็นแบบจำลองที่มีการออกแบบโครงสร้างสมบูรณ์มากที่สุด จึงใช้เป็นแบบอ้างอิงในการพัฒนาโปรโทคอลชุดอื่น ๆ
                    และยังง่ายต่อการอธิบายกลไกการทำงาน
                </Text>
                <Stack display="flex" mt="2" alignItems="center" py={{ base: 10, md: 18 }}>
                    <Image src="https://mindphp.com/images/knowledge/7layer.png" alt="Dan Abramov" />
                    <Badge borderRadius="full" px="2" colorScheme="teal" fontSize={"md"}>
                        รูปที่ 5.1 แบบโอเอสไอ
                    </Badge>
                </Stack>
                <Text fontSize={"3xl"} color="#251B37">
                    แบบจำลองแบ่งขั้นตอนการสื่อสารออกเป็น 7 ชั้น เริ่มจากผู้ใช้ต้องการส่งข้อมูลไปยังคอมพิวเตอร์ ข้อมูลจะถูกส่งไปยังชั้นที่ 7
                    ข้อมูลจะถูกดัดแปลงและเพิ่มเติม และส่งต่อไปยังชั้นต่ำกว่าทำต่อไปเรื่อย ๆ จนถึงชั้นต่ำสุด
                    ข้อมูลจะถูกแปลงเป็นสัญญาณเพื่อส่งไปยังสายสัญญาณหรือสื่อกลางในการติดต่อจนถึงเครื่องรับ ส่วนกระบวนการรับข้อมูลจะทำในทางตรงข้าม คือ
                    เริ่มจากชั้นที่ 1 และส่งต่อไปเรื่อย ๆ จนถึงชั้นสุดท้าย และส่งไปให้ผู้ใช้ใช้งาน
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    5.2.1 แบบจำลองโอเอสไอ
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    แบ่งขั้นตอนการสื่อสารเป็น 7 ขั้น จากชั้นบนสุดไปหาชั้นล่างสุด
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    1. ชั้นการประยุกต์ (Application Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานใกล้ชิดกับซอฟต์แวร์ประยุกต์ที่ต้องการส่งหรือรับ
                    กำหนดวิธีการที่ซอฟต์แวร์จะใช้ระบบเครือข่ายเพื่อการสื่อสารได้อย่างถูกต้องโดยมีอินเตอร์เฟรชเพื่อให้การโต้ตอบสะดวกยิ่งขึ้น เช่น
                    โปรแกรมส่งอีเมล เมื่อต้องการส่งอีเมล โปรแกรมจะติดต่อกับโปรโทคอลในชั้นนี้เพื่อเริ่มขบวนการทั้งหมด
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    2. ชั้นการนำเสนอ (Presentation Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานจะรับผิดชอบรูปแบบรับส่งข้อมูลผ่านเครือข่าย เนื่องจากคอมพิวเตอร์ที่ต้องการแลกเปลี่ยนอาจมีวิธีเข้ารหัสที่ต่างกัน (Encoding)
                    ดังนั้นก่อนการส่งข้อมูลจะแปลงข้อมูลให้อยู่ในรูปแบบมาตรฐาน
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ส่วนทางฝ่ายรับจะแปลงกลับไปเป็นรูปแบบที่เครื่องคอมพิวเตอร์เครื่องนั้นเข้าใจเพื่อให้ทั้งสองฝ่ายเข้าใจตรงกัน
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    3. ชั้นช่วงเวลา (Session Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    มีหน้าที่บริการโครงสร้างการทำงานแบบพร้อมเพรียงกัน ประสานเวลาและควบคุมหรือกำหนดวิธีแลกเปลี่ยนข้อมูลที่อาจเกิดขึ้น
                    มีการสร้างการเชื่อมต่อช่วงเวลาที่ต้องการและปลดปล่อยการเชื่อมต่อที่มีอยู่
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    บริการส่งข้อมูลปกติและการบริการส่งข้อมูลพิเศษเฉพาะกรณี รับรายงานสถานการส่ง บริหารรูปแบบการสื่อสารที่เกิดขึ้น เช่น
                    การสื่อสารระบบสองทิศทางหรือทิศทางเดียว เป็นต้น อีกหน้าที่หนึ่ง คือ การควบคุมการไหลของข้อมูลกับชั้นขนส่ง
                    หากสูญเสียการเชื่อมต่อจะสร้างการเชื่อมต่อขึ้นใหม่ทันทีที่สามารถทำได้เพื่อให้การเชื่อมต่อคงอยู่
                    นอกจากนี้มีหน้าที่ควบคุมการส่งข้อมูลของผู้ใช้ในเครือข่ายแบบวงแหวน ควบคุมการเกิดข้อผิดพลาดในการส่งด้วยการกำหนดจุดประสานเวลา
                    (Synchronization Point)
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    4. ชั้นขนส่ง (Transport Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานในชั้นนี้สำคัญมาก เนื่องจากการเชื่อมต่อไปยังปลายทางจะเกิดขึ้นในชั้นนี้ โปรโทคอลที่สำคัญในการเชื่อมต่อคือ โปรโทคอลทีซีพี
                    มีการเชื่อมต่อแบบกำหนดการเชื่อมต่อที่สามารถรับรองการส่งข้อมูลให้ถึงปลายทางอย่างถูกต้องและสมบูรณ์
                    ยังมีโปรโทคอลยูดีพีที่มีการเชื่อมต่อแบบไม่กำหนดการเชื่อมต่อ ข้อมูลจะถูกส่งไปยังปลายทางอย่างรวดเร็ว
                    แต่ไม่สามารถรับรองการส่งข้อมูลที่เกิดขึ้นว่าจะไม่สูญหายในระหว่างการส่งข้อมูล มีการเพิ่มข้อมูลเพื่อการส่งข้อมูลระหว่างซอฟต์แวร์ คือ
                    หมายเลขพอร์ต (Port Number) ใช้ในการระบุสื่อสารรระหว่างซอฟต์แวร์ต้นทางและปลายทาง
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    5. ชั้นเครือข่าย (Network Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานเป็นการช่วยกำหนดเส้นทางให้การสื่อสารข้อมูล สามารถส่งมอบข้อมูลข้ามระบบเครือข่ายที่แตกต่างกันได้
                    ข้อมูลที่ส่งเข้ามาจะถูกแบ่งเป็นส่วนเล็ก ๆ เรียกว่า แพ็กเก็ต ข้อมูลเพิ่มเติมช่วยให้การสื่อสารเกิดขึ้นได้ตามต้องการ คือ
                    เลขที่อยู่ไอพี การทำงานนอกจากจะเพิ่มเลขที่อยู่ไอพีแล้ว ยังทำหน้าที่ควบความคับคั่งของข้อมูลบนระบบเครือข่ายด้วย
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    6. ชั้นเชื่อมข้อมูล (Data Link Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานจะเตรียมส่งข้อมูลผ่านเครือข่ายทางกายภาพ มีจุดประสงค์หลักคือควบคุมการส่งข้อมูลให้เหมือนไม่มีข้อผิดพลาดเกิดขึ้น
                    ให้ชั้นที่สูงขึ้นไปสามารถนำข้อมูลไปใช้ได้ถูกต้อง รับผิดชอบการรับส่งข้อมูลและตรวจสอบความถูกต้อง โดยจัดข้อมูลเป็นเฟรม
                    ภายในเฟรมจะมีข้อมูลที่ทำให้สามารถส่งไปยังสถานีรับผ่านเครือข่ายแลนอย่างถูกต้องและมีประสิทธิภาพ
                    และต้องมีข้อมูลที่ใช้ในการตรวจสอบข้อผิดพลาดของเฟรมข้อมูล หากเกิดเหตุการณ์ผิดปกติระหว่างการรับส่งข้อมูล เช่น บางส่วนของเฟรมเสียหาย
                    ชั้นเชื่อมข้อมูลจะรับผิดชอบในการตรวจสอบและแก้ไขข้อผิดพลาด รับผิดชอบการจัดบิตต่อเนื่องที่ส่งจากชั้นกายภาพ
                    ให้เป็นเฟรมเดิมโดยใช้บัฟเฟอร์และใส่ข้อมูลที่ละบิตจนครบ
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    7. ชั้นกายภาพ (Physical Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานติดต่อกับอุปกรณ์การสื่อสารโดยตรง
                    ทำหน้าที่แปลงข้อมูลที่ต้องการส่งให้เป็นสัญญาณที่สอดคล้องกับอุปกรณ์ที่ใช้ไปส่งข้อมูลไปสู่ระบบเครือข่ายและจัดการแปลงสัญญาณข้อมูลที่ได้รับจากระบบให้เป็นข้อมูลฐานสองที่คอมพิวเตอร์สามารถเข้าใจได้
                    รวมทั้งประสานเวลาระดับบิตเพื่อให้สามารถส่งไปสู่ปลายทางได้ถูกต้องและสมบูรณ์
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    5.2.2 ประโยชน์ของการแบ่งโครงสร้างของโปรโทคอลเป็นแบบชั้น
                </Heading>
                <OrderedList fontSize={"3xl"} color="#16213E">
                    <ListItem>ทำงานระหว่างเครือข่ายได้อย่างมีประสิทธิภาพมากขึ้นโดยการเชื่อมต่อแบบมาตรฐาน</ListItem>
                    <ListItem>ทำงานและแก้ปัญหาที่เกิดขึ้นได้สะดวกขึ้น</ListItem>
                    <ListItem>ออกแบบและพัฒนาให้อยู่ในรูปแบบที่ได้รับความนิยมง่าย</ListItem>
                    <ListItem>เปลี่ยนชั้นการทำงานได้โดยไม่กระทบกับโครงสร้างอื่น</ListItem>
                </OrderedList>
                <Heading fontSize={"3xl"} color="#16213E">
                    5.2.3 ขั้นตอนการเปลี่ยนแปลงและส่งผ่านข้อมูล
                </Heading>
                <Stack display="flex" mt="2" alignItems="center" py={{ base: 10, md: 18 }}>
                    <Image src="https://www.commtech.co.th/wp-content/uploads/2022/08/OSIModel-1-1024x753.jpg" alt="Dan Abramov" />
                    <Badge borderRadius="full" px="2" colorScheme="teal" fontSize={"md"}>
                        รูปที่ 5.2 ขั้นตอนการเปลี่ยนแปลงและส่งผ่านข้อมูล
                    </Badge>
                </Stack>
                <Text fontSize={"3xl"} color="#16213E">
                    ขั้นตอนการเปลี่ยนแปลงและส่งผ่านข้อมูล ดังรูปที่ 5.4 มีดังนี้
                </Text>
                <OrderedList fontSize={"3xl"} color="#16213E">
                    <ListItem>การทำงานชั้นบนสุดจะทำการเปลี่ยนแปลงและจัดรูปแบบให้เป็นข้อมูลและทำการส่งชั้นการขนส่ง</ListItem>
                    <ListItem>
                        ชั้นขนส่งข้อมูล
                        เมื่อมีการส่งผ่านค่าจากข้อมูลไปเป็นเซกเมนต์และเพิ่มส่วนหัวซึ่งเป็นที่อยู่ทางกายภาพของข้อมูลเข้าไปแล้วส่งต่อไปยังชั้นเครือข่าย
                    </ListItem>
                    <ListItem>
                        ชั้นเครือข่าย เมื่อได้รับเซกเมนต์แล้วจะทำการเปลี่ยนข้อมูลให้อยู่ในรูปของแพ็กเก็ต
                        แล้วเพิ่มส่วนหัวซึ่งเป็นที่อยู่ทางกายภาพของข้อมูลเข้าไป และส่งมาที่ชั้นเชื่อมข้อมูล
                    </ListItem>
                    <ListItem>
                        ชั้นเชื่อมข้อมูล เมื่อได้รับแพ็กเก็ตข้อมูลจะทำการเปลี่ยนแปลงเป็นเฟรมแล้วเพิ่มส่วนหัวของข้อมูล แล้วส่งเฟรมนั้นไปชั้นกายภาพ
                    </ListItem>
                    <ListItem>ชั้นกายภาพ เมื่อได้รับเฟรมข้อมูลและทำการเปลี่ยนแปลงรูปแบบให้เป็นบิต เพื่อนำไปใส่ในตัวกลางเครือข่าย</ListItem>
                </OrderedList>

                <Heading fontSize={"3xl"} color="#16213E">
                    5.3 โปรโทคอลทีซีพี/ไอพี (Protocol)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    Transmission Control Protocol/Internet Protocol :TCP/IP เป็นโปรโทคอลที่ได้รับการพัฒนาจากระบบเครือข่ายอาร์พาเน็ต (ARPANET)
                    ได้รับการสนับสนุนจากกกระทรวงกลาโหม สหรัฐอเมริกา
                    มีวัตถุประสงค์เพื่อเชื่อมโยงการติดต่อสื่อสารระหว่างคอมพิวเตอร์ในมหาลัยและหน่วยงานของรัฐด้วยการใช้สายเช่าโทรศัพท์ (Leased Line)
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ต่อมามีการนำระบบสื่อสารด้วยคลื่นวิทยุและดาวเทียมมาใช้งานในระบบ ทำให้การติดต่อสื่อสารที่มีอยู่เดิมไม่สามารถนำมาใช้งานได้
                    จึงมีการปรับเปลี่ยนข้อตกลงและสถาปัตยกรรมเครือข่าย โดยวัตถุประสงค์หลัก คือ
                    เชื่อมต่อระบบที่มีความแตกต่างให้สามารถติดต่อสื่อสารกันได้ และพัฒนาการทำงานด้านต่างๆ จนสมบูรณ์
                    ซึ่งสามารถนำมาเปรียบเทียบแบบจำลองโอเอสไอได้
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    TCP/IP Model มีโครงสร้างสถาปัตยกรรม 4 ชั้น จากระดับบนสุดมาหาชั้นล่างสุด คือ ชั้นประยุกต์ ชั้นขนส่ง ชั้นอินเทอร์เน็ต
                    และชั้นควบคุมการติดต่อระดับเครือข่ายสำหรับหน้าที่ต่างๆ ในแต่ละชั้น มีรายละเอียดดังรูป 5.5
                </Text>
                <Stack display="flex" mt="2" alignItems="center" py={{ base: 10, md: 18 }}>
                    <Image src="https://media.geeksforgeeks.org/wp-content/uploads/tcpAndOSI.png" alt="Dan Abramov" />
                    <Badge borderRadius="full" px="2" colorScheme="teal" fontSize={"md"}>
                        รูปที่ 5.3 ทีซีพี/ไอที (TPC/IT)
                    </Badge>
                </Stack>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    1. ชั้นการประยุกต์ (Application Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    การทำงานเป็นการติดต่อระหว่างผู้ใช้กับแอปพลิเคชันและควบคุมข้อมูลที่จะส่งผ่านไปยังชั้นอื่นๆ
                    รวมถึงการเข้าใช้ทรัพยากรระยะไกลและการแชร์ทรัพยากรสำหรับโปรโทคอลย่อยในชั้นนี้
                </Text>

                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (1) Hyper Text Transfer Protocol : HTTP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้ส่งข้อมูลประเภทเว็บเพจบนเว็บเซิร์ฟเวอร์ให้คอมพิวเตอร์ที่ร้องขอข้อมูลผ่านโปรแกรมประเภทเบราเซอร์
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (2) Simple Mail Transfer Protocol : SMTP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้ส่งอีเมลจากเครื่องผู้ใช้ไปยังเมลเซิร์ฟเวอร์ตามที่ระบุไว้
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (3) File Transfer Protocol : FTP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้รับส่งไฟล์ระหว่างคอมพิวเตอร์ของผู้ใช้กับคอมพิวเตอร์ที่เป็นเอฟทีพีเซิร์ฟเวอร์
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (4) Domain Name System : DNS
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    สำหรับแปลงชื่อโดเมนให้เป็นไอพีแอดเดรส
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (5) Simple Network Management Protocol : SNMP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    สำหรับตรวจสอบการทำงานของอุปกรณ์ในระบบเครือข่าย เช่น ตรวจสอบการทำงานของเราท์เตอร์
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (6) Telecommunication Network : Telnet
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้สำหรับล็อกอินเพื่อเชื่อมต่อเข้าเซิร์ฟเวอร์จากระยะไกล
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (7) Dynamic Host Configuration Protocol : DHCP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้แจกไอพีแอสเดรส ให้กับลูกข่ายโดยอัตโนมัติ
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (8) Post Office Protocol : POP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้ในการดาวน์โหลดข้อมูลจากเมลเซิร์ฟเวอร์
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    2. ชั้นขนส่งข้อมูล (Transport Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำหน้าที่ควบคุมการขนส่งข้อมูลจากต้นทางไปปลายทางและตรวจสอบความถูกต้องของแพ็กเก็ต มีโปรโทคอล 2 ตัว TCP และ UDP
                    ซึ่งลักษณะการทำงานแตกต่างกันดังนี้
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (1) Transmission Control Protocol : TCP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานในลักษณะคอนเน็กชันโอเรียนเต็ด (Connection Oriented) โดยจะแบ่งข้อมูลเป็นส่วนย่อยๆ
                    ส่งออกไปยังปลายทางและประกอบเป็นข้อมูลที่ถูกต้องตามเดิม หากมีข้อมูลขาดหายจะมีการแจ้งกลับเพื่อให้ส่งไปใหม่
                    จึงเป็นการรับประกันว่าปลายทางจะได้รับข้อมูลที่สมบูรณ์ถูกต้องเสมอ
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (2) User Datagram Protocol : UDP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำงานในลักษณะคอนเน็กชันเลส (Connectionless) โดยจะส่งข้อมูลออกไปโดยไม่มีการตรวจสอบว่าปลายทางได้รับข้อมูลถูกต้องหรือไม่
                    ไม่รับประกันความถูกต้อง ไม่มีการตอบกลับ ทำให้ส่งข้อมูลได้รวดเร็วกว่า มักถูกนำมาใช้ในงานมัลติมิเดีย
                    มีข้อดีที่มีความเร็วในการส่งข้อมูล
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    3. ชั้นอินเทอร์เน็ต (Internet Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำหน้าที่ส่งข้อมูลผ่านเครือข่ายตามเส้นทางให้ถึงปลายทาง โดยใช้การส่งที่เรียกว่า “ระบบเครือข่ายแบบสลับช่องสื่อสารระดับแพ็กเก็ต
                    (Packet-Switching Network)” เป็นลักษณะการติดต่อแบบไม่ต่อเนื่อง เรียกว่า คอนเน็กชันเลส ไม่มีการรับประกันความถูกต้องของข้อมูล
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    โดยเครื่องต้นทางจะส่งข้อมูลไปยังเครือข่าย ในระบบอย่าอิสระจนกว่าข้อมูลจะถึงปลายทาง โปรโทคอลย่อยในชั้นนี้ มีดังนี้
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (1) Internet Protocol : IP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้เลือกเส้นทางและเป็นโปรโทคอลหลักในการส่งข้อมูลในเครือข่าย
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (2) Address Resolution Protocol : ARP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    แปลงไอพีแอดเดรสให้เป็นหมายเลขประจำฮาร์ดแวร์เรียกว่า แมคแอดเดรส เพื่อให้ต้นทางสามารถทราบหลายเลขแมดแอดเดรสปลายทางได้
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (3) Reverse Address Resolution Protocol : RARP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำหน้าที่เหมือนเออาร์พี แต่อาร์เออาร์พีจะใช้ติดต่อกับคอมพิวเตอร์ปลายทางด้วยแมคแอดเดรส
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (4) Internet Control Message Protocol : ICMP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ใช้สำหรับแจ้งข้อผิดพลาดที่เกิดขึ้นจากปัญหาการส่งถ่ายข้อมูล
                </Text>
                <Text fontSize={"3xl"} color="#16213E" p={6}>
                    (5) Internet Group Management Protocol : IGMP
                </Text>
                <Text fontSize={"3xl"} color="#16213E">
                    ทำหน้าที่แจ้งและรายงานข้อมูลให้กับกลุ่มไอพี แอดเดรส ที่เป็นสมาชิกกลุ่มมัลติคลาสต์ (Multicast)
                    เป็นการส่งข้อมูลแบบหนึ่งต่อหลายเครื่อง
                    โดยแจ้งข้อมูลดังกล่าวให้อุปกรณ์เราท์เตอร์ที่อยู่ภายในเครือข่ายเพื่อให้สามารถรองรับการติดต่อในรูปแบบดังกล่าวได้
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    4. ชั้นควบคุมการติดต่อระดับเครือข่าย (Host–to–Network Layer)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    เป็นชั้นที่ไม่กำหนดรายละเอียดอย่างเป็นทางการ หน้าที่หลัก คือ รับข้อมูลจากชั้นติดต่อระดับเครือข่ายอินเทอร์เน็ต
                    แล้วส่งไปยังโหนดปลายทาง เมื่อผู้รับได้รับข้อมูลจะส่งข้อมูลให้ชั้นติดต่อเครือข่ายอินเทอร์เน็ต ภายในชั้นไม่มีการกำหนดมาตรฐาน
                    แต่ทีซีพี/ไอพี สามารถให้ได้กับเครือข่ายหลายประเภท เช่น อีเทอร์เน็ต เอทีเอ็ม พีพีพี และไอเอสดีเอ็น เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#16213E" p={6}>
                    สรุปสาระสำคัญ
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    ระบบเครือข่ายคอมพิวเตอร์ที่ทำให้มีความพร้อมในการทำงานอย่างมีประสิทธิภาพสำหรับการประยุกต์ใช้งานต่างๆ นั้น ต้องมีมาตรฐานต่าง
                    รองรับอย่างเป็นระบบ ทั้งนี้เพื่อให้สอดคล้องกับกับผลิตวัสดุอุปกรณ์ด้านฮาร์ดแวร์จากแหล่งผลิตที่หลากหลายที่สามารถนำมาใช้งานร่วมกันได้
                    ดังนั้นจึงจำเป็นต้องมีหน่วยงานสากลเพื่อกำหนดมาตรฐานขึ้นมา เช่น ไอโซ ไอทียูที แอนซี ไอทริพเพิล และอีไอเอ เป็นต้น
                    การนำรูปแบบของระบบเครือข่ายมาใช้งานจริง จำเป็นต้องมีมาตรฐานสากลเพื่อทำให้เครือข่ายประเภทต่างๆ ทำงานร่วมกันได้
                    มาตรฐานเครือข่ายในระดับสากล คือ แบบจำลองโอเอสไอ (OSI Model) ซึ่งเป็นมาตรฐานในการกำหนดสถาปัตยกรรมของเครือข่ายคอมพิวเตอร์
                    สำหรับสถาปัตยกรรมที่ซีพี/ไอพี ซึ่งมีการแบ่งหน้าที่หรือบริการต่างๆ ของระบบเครือข่ายออกเป็นระดับชั้นหรือเลเยอร์แบ่งการทำงานออกเป็น 4
                    ชั้น ได้แก่ ชั้นเข้าถึงเครือข่าย ชั้นอินเทอร์เน็ตชั้นเชื่อมต่อ ระหว่างเครือข่าย และชั้นการประยุกต์
                </Text>
            </Box>
        </Container>
    )
}
