import { Flex, Container, Heading, Stack, Text, Button, Icon, IconProps, Grid, GridItem, Box, Spacer, Image } from "@chakra-ui/react"
import Chapter1 from "../components/chapter/image/pic1.jpg"
import { extendTheme } from "@chakra-ui/react"

export default function chapter1() {
    const spacing = {
        space: {
            px: "1px",
            0.5: "0.125rem",
            1: "0.25rem",
            1.5: "0.375rem",
            2: "0.5rem",
            2.5: "0.625rem",
            3: "0.75rem",
            3.5: "0.875rem",
            4: "1rem",
            5: "1.25rem",
            6: "1.5rem",
            7: "1.75rem",
            8: "2rem",
            9: "2.25rem",
            10: "2.5rem",
            12: "3rem",
            14: "3.5rem",
            16: "4rem",
            20: "5rem",
            24: "6rem",
            28: "7rem",
            32: "8rem",
            36: "9rem",
            40: "10rem",
            44: "11rem",
            48: "12rem",
            52: "13rem",
            56: "14rem",
            60: "15rem",
            64: "16rem",
            72: "18rem",
            80: "20rem",
            96: "24rem",
        },
    }
    const theme = extendTheme({ ...spacing })

    return (
        <Container maxW={"9xl"}>
            <Stack textAlign={"center"} align={"center"} spacing={{ base: 8, md: 10 }} py={{ base: 20, md: 28 }}>
                <Heading fontWeight={600} fontSize={{ base: "2xl", sm: "3xl", md: "4xl" }} lineHeight={"110%"}>
                    บทที่2 อุปกรณ์ระบบเครือข่าย
                </Heading>
            </Stack>
            <Text fontSize={{ base: "3xl", sm: "1.5xl", md: "3xl" }} lineHeight={"110%"} color="black">
                2.1อุปกรณ์ที่ใช้งานในระบบเครือข่ายทั่วไป
            </Text>
            <Box gap={6} p={12}>
                <Text fontSize={"2xl"} color="#1B2430">
                    ในการเชื่อมต่อในระบบเครือข่ายคอมพิวเตอร์
                    จะต้งอใช้อุปกรณ์ในการเชื่อมต่อที่แตกต่างกันไปตามคุณสมบัติทางด้านสถาปัตยกรรมและมาตรฐานของเครือข่าย
                    ซึ่งอุปกรณ์ที่ใช้ในระบบเครือช่ายในปัจจุบันนั้นมีอยู่มากมาย
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.1 เครื่องคอมพิวเตอร์ การเชื่อมต่อระบบเครือข่ายทั้งแบบมีสายสัญญาณและแบบไร้สายถือว่าเครื่องคอมพิวเตอร์เป็นส่วนหลักของระบบ
                    มีทั้งแบบตั้งโต๊ะและแบบโน๊ตบุ๊ก และมีอุปกรณ์ที่เชื่อมต่อระบบเครือข่ายหลายชนิด เช่น โทรศัพท์แบบพกพา (Mobile Phone) พีดีเอ (PDA)
                    และแท็ปเล็ต (Tablet) เป็นต้น
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.2 เน็ตเวิร์กการ์ด (Network Interface Card: NIC) เรียกกันว่า แลนการ์ด (LAN Card)
                    มีลักษณะเป็นแผ่นการ์ดวงจรอิเล็กทรอนิกส์เพื่อเสียบลงไปยังแผงวงจรหลักของเครื่องคอมพิวเตอร์
                    โดยทำหน้าที่ในการแปลงสัญญาณข้อมูลในเครือข่ายเป็นสัญญาณสำหรับการสื่อสารให้กับคอมพิวเตอร์
                    ปัจจุบันนี้ส่วนใหญ่จะเป็นการ์ดที่สามารถใช้ทั้งในระบบอีเทอร์เน็ต (Ethernet Card) ในมาตรฐาน 10BaseT ใช้ความเร็วสำหรับการส่งข้อมูล 10
                    เมกะบิตต่อวินาที และระบบอีเทอร์เน็ตความเร็วสูง ในมาตรฐาน 100BaseT หรือมาตรฐาน IEEE 802.3u รองรับความเร็ว 10/100เมกะบิตต่อวินาที
                    เรียกว่า “ฟาสอีเทอร์เน็ต (Fast Ethernet)” ที่มีการเชื่อมต่อกับเครือข่ายผ่านหัวต่ออาร์เจ-45 (RJ-45)
                    ปัจจุบันได้มีการผลิตเน็ตเวิร์กการ์ดที่รองรับความเร็วในส่งสูงถึง 10 จิกะบิต เรียกว่า จิกะบิตแลนการ์ด (Gigabit LAN Card)
                    นอกจากนี้ยังมีแลนการ์ดแบบไร้สาย (Wireless LAN Card) ออกมาใช้มากขึ้นและรองรับความเร็วมากขึ้นตั้งแต่ 11 Mbps ถึง 108 Mbps
                    ซึ่งภายในแผงวงจนหลักของเครื่องคอมพิวเตอร์บางเครื่องอาจผนวกแผงวงจรเน็ตเวิร์กการ์ดแบบไร้สายไว้แล้ว
                    เน็ตเวิร์กการ์ดเป็นอุปกรณ์ที่ทำงานอยู่ในเลเยอร์ที่ 1 และ 2 เทียบกับแบบจำลองโอเอสไอ เพราะเน็ตเวิร์กการ์ดทำงานในระดับชั้นกายภาพ
                    เน็ตเวิร์กการ์ดแต่ละใบนั้นจะมีการกำหนดหมายเลขเฉพราะตัวจากบริษัทผู้ผลิตและข้อมูลมาตรฐานประจำการ์ดโดยจะมีค่าไม่ซ้ำกันเรียกว่า
                    แมคแอดเดรส (Media Access Control Address: MAC Address) ที่ทำงานในระดับชั้นเชื่อมข้อมูลหรือดาต้าลิงก์เลเยอร์
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.3 ฮับ (Hub) ฮับเป็นอุปกรณ์ที่ใช้เชื่อมต่อเครื่องคอมพิวเตอร์เข้าด้วยกัน ทำหน้าที่เป็นศูนย์กลางในการกระจายข้อมูลไปยังเครื่องต่าง
                    ๆ และเป็นอุปกรณ์ที่ทำหน้าที่ทวนสัญญาณ ฮับจะส่งข้อมูลขากเครื่องต้นทางไปยังเครื่องปลายทาง ส่งไปในลักษณะกระจายยังทุกพอร์ต (Port)
                    ทำให้คอมพิวเตอร์ทุกเครื่องที่เชื่อมต่อกับฮับเห็นข้อมูลเข้ามาทุกครั้ง ถ้าข้อมูลเป็นของคอมพิวเตอร์เครื่องใด
                    คอมพิวเตอร์เครื่องนั้นจะรับไป ถ้าใช่จะไม่รับ การทำงานลักษณะนี้ เป็นการใช้ช่องทางที่ไม่จำเป็น
                    จึงเกิดการชนกันของข้อมูลค่อนข้างมากในเครือข่าย เพราะข้อมูลจะถูกส่งไปยังคอมพิวเตอร์ทุกเครื่องที่เชื่อมต่ออยู่
                    และเกิดความคับคั่งของข้อมูลในเครือข่าย ทำให้ความเร็วภายในเครือข่ายลดลง ฮับจะแชร์แบรนด์วิดท์ (Bandwidth)
                    ให้กับเครื่องคอมพิวเตอร์ทุกเครื่องที่เชื่อมต่ออยู่บนฮับเดียวกัน เช่น ระบบเครือข่ายที่ทำงานแบบ100 เมกะบิตต่อวินาที
                    และมีเครื่องคอมพิวเตอร์เชื่อมต่อบนฮับ 10 เครื่อง แบนด์วิดท์ที่ผ่านฮับจะถูกแบ่งออกเป็นเครื่องละ 10 เมกะบิตต่อวินาที
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.4 บริดจ์ (Bridge) บริดจ์เป็นอุปกรณ์ที่ทำหน้าที่คล้ายกับสะพานเชื่อมโยงระหว่างสองเครือข่ายขึ้นไป
                    ทำหน้าที่เชื่อมต่อเครือข่ายสองเครือข่ายที่ใช้ทอพอโลยีเดียวกันเข้าด้วยกันแลพทั้งสองเครือข่ายใช้โปรโทคอลสื่อสารเดียวกันหรือแตกต่างกันก็ได้
                    บริดจ์ทำหน้าที่ในการกลั่นกรองเฟรมข้อมูลที่ถูกส่งออกจากแหล่งข้อมูลและตรวจสอบว่าปลายทางที่ต้องรับข้อมูลอยู่ในระบบเครือข่ายเดียวกับแหล่งส่งข้อมูลหรือไม่
                    การสื่อสารที่เกิดขึ้นจะไม่มีการส่งเฟรมข้อมูลกระจายไปทั่วเครือข่าย มีการแบ่งแยกเครื่องออกจากกันอย่างชัดเจน
                    ช่วยในการควบคุมความคับคั่งของข้อมูลที่สื่อสารบนเครือข่ายได้ ซึ่งแตกต่างฮับที่เป็นอุปกรณ์ทวนสัญญาณเท่านั้น
                    ไม่ได้แบ่งแยกเครือข่ายออกจากกัน นอกจากนี้บริดจ์ยังสามารถทำหน้าที่ตรวจสอบความถูกต้องของข้อมูลที่ส่งได้ในเบื้องต้น
                    การทำงานของบริดจ์จะทำงานอยู่ในชั้นเขื่อมข้อมูลบนแบบจำลองโอเอสไอ
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.5 สวิตช์ (Switch) สวิตช์เป็นอุปกรณ์ในการเชื่อมต่อในระบบเครือข่าย ทำหน้าที่อยู่ในเลเยอร์ที่2 ถูกพัฒนามาแทนที่ฮับ
                    สวิตช์สามารถส่งข้อมูลที่ได้รับมาจากพอร์ตหนึ่งไปยังเฉพาะพอร์ตที่เป็นปลายทางเท่านั้น
                    ทำให้คอมพิวเตอร์ที่เชื่อมต่อกับพอร์ตที่เหลือสามารถส่งข้อมูลถึงกันและกันได้ในเวลาเดียวกัน
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.6 เราท์เตอร์ (Router) เราท์เตอร์เป็นอุปกรณ์ที่ทำหน้าที่ในเลเยอร์ที่3 หรือชั้นเครือข่าย
                    และเป็นอุปกรณ์ที่ใช้เชื่อมโยงระหว่างหลาย ๆ เครือข่ายเข้าด้วยกัน การสื่อสารที่เกิดขึ้น มักจะเป็นการสื่อสารในระยะไกล
                    แตกต่างจากสวิตช์ทีจะใช้ในการสื่อสายภายในองค์กรเท่านั้น แต่เราท์เตอร์สามารถเชื่อมต่อระหว่างองค์กรได้
                    และเครือข่ายที่เชื่อมต่อด้วยเราท์เตอร์ คือเครือข่ายอินเทอร์เน็ต
                    ดั้งนั้นการสื่อสารในระยะไกลเหล้านี้จะทำงานโดยใช้โปรโทคอลทีซีพี/ไอพี และใช้เลขที่อยู่ไอพีเป็นหมายเลขเพื่อสร้างการสื่อสาร
                    ซึ่งมีความสำคัญมากที่สุด
                </Text>
                <Heading fontSize={"3xl"} color="#04293A">
                    การทำงานของเราท์เตอร์สามารถแบ่งออกได้เป็นการทำงาน 2 ส่วน
                </Heading>
                <Text fontSize={"2xl"} color="#04293A">
                    1.การหาเส้นทางส่งข้อมูลที่ดีที่สุด
                </Text>
                <Text fontSize={"2xl"} color="#04293A">
                    2.การส่งข้อมูลสู่เครือข่าย
                </Text>
                <Text fontSize={"2xl"} color="#04293A">
                    การกำหนดหาเส้นทางที่ดีที่สุดมีหลายวิธี เช่น
                    การพิจารณาจำนวนการเชื่อมต่อหรือโหนดที่ต้องผ่านขณะที่ข้อมูลถูกส่งไปสู่เครื่องรับข้อมูลปลายทาง เป็นต้น
                    เราท์เตอร์จะใช้เลขที่อยู่ไอพีของเครื่องปลายทางที่ส่งมาพร้อมกับแพ็กเก็ต สำหรับตารางการหาเส้นทาฃ (Routing Table)
                    ที่เก็บในหน่วยความจำของเราท์เตอร์ จะกำหนดเส้นทางในการส่งของแพ็กเก็ตไปสู่ปลายทางที่ต้องการ
                    โดยส่วนใหญ่เราท์เตอร์จะมีการปรับค่าในตารางการหาเส้นทางจากข้อมูลเส้นทางที่ได้จากเราท์เตอร์อื่นๆ
                    ที่อยุ่ติดกันเพื่อให้ได้เส้นทางที่ดีที่สุด ในการส่งข้อมูลสู่ช่องทางการสื่อสารแต่ละเส้นทางการสื่อสาร
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.7 โมเด็ม (Modem) โมเด็มเป็นอุปกรณ์ที่ทำหน้าที่แปลงสัญญาณจากคอมพิวเตอร์ให้สามารถส่งสัญญาณผ่านสายโทรศัพท์
                    เพื่อติดต่อสื่อสารกับคอมพิวเตอร์อื่นที่อยู่ต่างเครือข่ายได้
                    โมเด็มเป็นเสมือนโทรศัพท์สำหรับคอมพิวเตอร์ที่ช่วยให้ระบบคอมพิวเตอร์สามารถสื่อสารกับคอมพิวเตอร์อื่น ๆ ได้ทั่วโลก
                    โมเด็มจะทำงานสำเร็จจนได้ด้วยการเชื่อมต่อระหว่างคอมพิวเตอร์เข้าคู่สายของโทรศัพท์ธรรมดาคู่หนึ่ง ซึ่งโมเด็มจะทำการแปลงสัญญาณดิจิทัล
                    (Digital Signal) จากเครื่องคอมพิวเตอร์ให้เป็นสัญญาณแอนะล็อก (Analog Signal) เพื่อให้สามารถส่งไปบนคู่สายของโทรศัพท์ก็ได้
                </Text>
                <Heading fontSize={"3xl"} color="#142850">
                    โดยแบ่งลักษณะโมเด็มเป็น 2 ชนิด คือ โมเด็มแบบติดตั้งภายใน และโมเด็มแบบติดตั้งภายนอก
                </Heading>
                <Text fontSize={"2xl"} color="#142850">
                    1.โมเด็มแบบติดตั้งภายใน (Internal Modem) โมเด็มแบบที่การ์ดเสียบเข้ากับสล็อต (slot) หรือช่องต่อ จะติดตั้งกับสล็อตแบบพีซีไอ (Slot
                    PCI) ที่อยู่ภายในเครื่องคอมพิวเตอร์ทำให้ไม่ต้องอาศัยกระแสไฟภายนอกหรือสายเคเบิลในการเชื่อมต่อ
                    คอมพิวเตอร์และแล็ปท็อปจะติดตั้งโมเด็มประเภทนี้ไว้ในตัวเครื่องแล้ว ทำให้ไม่เปลืองพื้นที่ใช้งานสิ้นเปลืองกระแสไฟฟ้าน้อย
                    และ่งข้อมูลได้เร็วกว่าแบบติดตั้งภายนอก แต่ถ้าทำงานไปนาน ๆ จะเกิดความร้อนสะสมภายในตัวเครื่อง
                    ทำให้สิ้นเปลืองกระแสไฟฟ้าสำหรับการเลือกซื้อโมเด็มแบบติดตั้งภายใน และต้องคำนึงถึงแบบของสล็อตที่ว่างอยู่ในเครื่องคอมพิวเตอร์ด้วย
                    โดยต้องตรวจสอบว่าสล็อตที่ว่างอยู่บนเมนบอร์ดเป็นสล็อตแบบพีซีไอ(PSI)หรือแบบไอเอสเอ (ISA) ต้องเลือกให้ถูกต้องและเหมาะสมกับการใช้งาน
                    แต่ถ้าบนเมนบอร์ดของคอมพิวเตอร์มีสล็อตทั้ง 2 แบบ ควรเลือกใช้แบบพีซีไอเพราะ แบบพีซีไอราคาถูกกว่าและทำงานได้เร็ว
                </Text>
                <Text fontSize={"2xl"} color="#142850">
                    2.โมเด็มแบบติดตั้งภายนอก (External Modem) โมเด็มแบบติดตั้งถายนอกจะใช้อาศัยกระแสไฟจากแยกจากเครื่องคอมพิวเตอร์ต่างหาก
                    ทำให้ไม่ต้องใช้กระแสไฟร่วมกับหน่วยประมวลผลกลางหรืออุปกรณ์อื่น
                    การเชื่อมต่อจะใช้สายเคเบิลในการเชื่อมต่อเข้ากับคอมพิวเตอร์ผ่านพอร์ตต่าง ๆ เช่น พอร์ตอนุกรม (Serial Port) ยูเอสบีพอร์ต (USB Port)
                    หรือ ไฟร์ไวร์พอร์ต ( FireWire Port) ของแล็ปท็อป เป็นต้น
                </Text>
                <Text fontSize={"2xl"} color="#142850">
                    โมเด็มชนิดนี้จะมีสัญญาณไฟบอกสถานะการทำงานด้วย เพื่อบอกให้ผู้ใช้ทราบว่าตัวโมเด็กทำงานปกติหรือไม่
                    สะดวกในการย้ายไปใช้กับเครื่องคอมพิวเตอร์เครื่องอื่น เพียงแต่มีพอร์ตอนุกรมที่ว่างและมีพื้นที่วางตัวโมเด็มที่ต้องติดตั้งอยู่ภายนอก
                    ส่วนราคาค่อนข้างแพงกว่าโมเด็มแบบติดตั้งภายใน
                </Text>
                <Text fontSize={"2xl"} color="#1B2430">
                    2.1.8 เกตเวย์(Gateway)
                    เกตเวย์เป็นอุปกรณ์ที่นำไปใช้งานเพื่อเป็นประตูสำหรับการเชื่อมต่อโยงเครือข่ายคอมพิวเตอร์ที่มีสถาปัตยกรรมระบบที่แตกต่างกัน เช่น
                    เครื่องคอมพิวเตอร์ภายในเครือข่ายกับเครื่องเมนเฟรมคอมพิวเตอร์
                    ดังนั้นเกตเวย์จึงเป็นอุปกรณ์สำคัญสำหรับระบบคอมพิวเตอร์ที่มีสถาปัตบกรรมที่แตกต่างกัน ให้สามารถเชื่อมโยงเครือข่ายเข้าด้วยกันได้
                </Text>
                <Text fontSize={"2xl"} color="#160F30">
                    2.2 อุปกรณ์ที่ใช้เชื่อมต่อแบบไร้สาย สำหรับการเชื่อมต่อเครื่องคอมพิวเตอร์กับระบบเครือข่ายแบบไร้สายนั้น
                    จำเป็นต้องมีอุปกรณ์ที่ใช้ในการเชื่อมต่อ เช่น แอกเซสพอยต์(Access Point) การ์ดแลนไร้สาย(Card Lan) เสาอากาศ(Antenna)
                </Text>
                <Text fontSize={"2xl"} color="#160F30">
                    2.2.1 แอกเซสพอยต์ (Access Point) แอกเซสพอยต์เป็นอุปกรณ์ที่เป็นศูนย์กลางในการเชื่อมต่อสำหรับระบบเครือข่ายแบบไร้สาย
                    ทำหน้าที่เป็นตัวกระจายสัญญาณแบบไร้สาย เพื่อให้เครื่องคอมพิวเตอร์รับสัญญาณการสื่อสารกับเครือข่ายได้
                </Text>
                <Text fontSize={"2xl"} color="#160F30">
                    2.2.2 การ์ดแลนไร้สาย(Card Lan Wireless) ปัจจุบันการ์ดแลนไร้สายถูกออกแบบให้ใช้กับเครื่องคอมพิวเตอร์ประเภทต่าง ๆ
                    มีความเร็วในการส่งข้อมูล ปัจจุบันมีความเร็วถึง 108 เมกะบิตต่อวินาที
                </Text>
                <Text fontSize={"2xl"} color="#472D2D">
                    1.การ์ดแลนไร้สายแบบพีซีไอ (Peripheral Component Interconnect: PCI) สำหรับการติดตั้งบนเครื่องคอมพิวเตอร์แบบตั้งโต๊ะ
                    เพื่อเชื่อมต่อกับระบบเครือข่ายแบบไร้สาย มีความเร็วสำหรับการรับส่งตั้งแต่ 11 ถึง 54 เมกะบิตต่อวินาที
                </Text>
                <Text fontSize={"2xl"} color="#472D2D">
                    2.การ์ดแลนไร้สายแบบพีซีเอ็มซีไอเอ (Personal Computer Memory Card Onternational Association: PCMCIA)
                    ลักษณะเป็นแผ่นโลหะสี่เหลี่ยมผืนผ้า ที่มีอินเตอร์เฟซแบบพีซีเอ็มซีไอเอ มีเสาอากาศอยู่ภายในการ์ด
                    ทำให้สามารถเชื่อมต่อรับสัญญาณจากแอกเซสพอยต์ ปัจจุบันไม่ต้องมีการใช้งาน
                    เนื่องจากโน็ตบุ๊กทั่วไปติดตั้งการ์ดแลนไร้สายไว้ภายในเรียบร้อยแล้ว
                </Text>
                <Text fontSize={"2xl"} color="#472D2D">
                    3.การ์ดไลนไร้สายแบบเอก์เพรส (Express Card: EC) ส่วนใหญ่ใช้กับโน๊ตบุ๊กรุ่นสหม่
                    การ์ดมีขนาดเล็กและมีความเร็วในการรับส่งสูงกว่าแบบพีซีเอ็มซีไอเอ
                </Text>
                <Text fontSize={"2xl"} color="#472D2D">
                    4.การ์ดแลนไร้สายแบบยูเอสบี (Universal Serial Bus: USB)
                    ปัจจุบันเครื่องคอมพิวเตอร์ทั้งแบบตั้งโต๊ะและแบบโน๊ตบุ๊กมีพอร์ตมาตรฐานยูเอสบีติดตั้ง ภายในเครื่องคอมพิวเตอร์มาเรียบร้อย
                    ทำให้สะดวกในการติดตั้งการ์ดแลนไร้สายแบบยูเอสบี ไม่จำเป็นต้องเปิดตัวเครื่องในการติดตั้ง
                </Text>
                <Text fontSize={"2xl"} color="#160F30">
                    2.2.3 เสาอากาศ (Wirless Antenna) หน้าที่หลักของเสาอากาศ คือ
                    ที่ส่งคลื่นวิทยุที่ส่งออกมาจากภาคส่งของอุปกรณ์ประเภทที่ใช้เป็นคลื่นแม่เหล็กไฟฟ้ากระจายออกไปในอากาศ
                    และทำหน้าที่รับคลื่นที่อุปกรณ์ไวร์เลสแลนเครื่องอื่น ๆ ส่งออกมาแล้งแปลงกลับให้อยู่ในรูปของกระแสไฟฟ้าส่งให้ภาครับต่อไป
                </Text>
                <Text fontSize={"2xl"} color="#160F30">
                    เสาอากาศเป็นอุปกรณ์ชนิดที่มีความสำคัญมาก หากเสาอากาศไม่มีคุณภาพจะส่งสัญญาณไม่ออก ไม่สามารถรับสัญญาณได้เลย
                    มีตัวแปรหลายค่าที่ใช้บอกคุณสมบัติของเสาอากาศ เช่น เกน (Gain)
                    เป็นตัวบอกว่าเสาอากาศนี้มีคุณสมบัติในการแปลงคลื่นแม่เหล็กไฟฟ้ามาเป็นสัญญาณไฟฟ้าได้ดีเพียงใด ค่าบีมวิดท์ (Beamwidth)
                    บอกรูปร่างลักษณะการกระจายคลื่นว่าเป็นค่าเอสดับเบิลยูอาร์ (SWR) เป็นตัวเลขที่บอกถึงคลื่นที่สะท้อนกลับมาเมื่อส่งสัญญาณออกอากาศไป
                </Text>
                <Heading fontSize={"3xl"} color="#493323">
                    1.เสาอากาศแบบรอบตัว (Omni Directional Antenna)
                </Heading>
                <Text fontSize={"2xl"} color="#493323">
                    มีทิศทางการแพร่กระจายคลื่นรอบทิศทาง 360 องศา ให้ระยะทางที่ไม่ไกลนัก ในระยะรัศมี 80 เมตร
                    เหมาะสำหรับใช้ติดต่อกับเครื่องลูกข่ายที่เคลื่อนไหวอยู่ในตำแหน่งและทิศทางที่ไม่แน่นอน
                </Text>
                <Heading fontSize={"3xl"} color="#493323">
                    2.เสาอากาศแบบทิศทาง (Directional Antenna)
                </Heading>
                <Text fontSize={"2xl"} color="#493323">
                    มีทิศทางการแพร่กระจายของคลื่นที่ทิศทางชัดเจน ให้สัญญาณที่ความแรงในแนวตรง เหมาะสำหรับการติดต่อระหว่างจุดต่อจุด
                    สามารถเพิ่มระยะทางการใช้งานได้ไกลกว่าเสาอากาศแบบรอบตัว ข้อเสียคือถ้าไม่อยู่ในทิศทางการแพร่กระจายของคลื่น จะไม่สามารถรับสัญญาณได้
                    ชื่อของเสาอากาศแบบที่นิยมใช้ ได้แก่ เสาอากาศแบบเซ็กเตอร์ (Sector Antenna) เสาอากาศแบบยาดิ (Yagi Antenna) เสาอากาศแบบกริด (Grid
                    Antenna) และเสาอากาศแบบจาน (Solid Dish Antenna) เป็นต้น
                </Text>
                <Heading fontSize={"3xl"} color="#8C0000">
                    สรุปสาระสำคัญ
                </Heading>
                <Text fontSize={"2xl"} color="#8C0000">
                    อุปกรณ์ที่ใช้ในระบบเครือข่ายแบบไร้สายในปัจจุบันนั้นมีอยู่มากมาย ได้แก่ เน็ตเวิร์กการ์ด ฮับ สวิตช์ บริดจ์ โมเด็ม เราท์เตอร์ เกตเวย์
                    เป็นต้น เนื่องจากการพัฒนาทางด้านเทคโนโลยีในปัจจุบันเป็นไปอย่างรวดเร็ว จึงทำให้อุปกรณ์ต่าง ๆ
                    ต้องมีคุณสมบัติที่รองรับกับการพัฒนาต่าง ๆ ซึ่งหากผู้ใช้ทราบถึงคุณสมบัติ
                </Text>
                <Text fontSize={"2xl"} color="#8C0000">
                    สำหรับการเชื่อมต่อกับเครื่องคอมพิวเตอร์กับระบบเครือข่ายไร้สายนั้น มีอุปกรณ์ที่ใช้สำหรับการเขื่อมต่อหลายประเภท ได้แก่ แอกเซสพอยต์
                    การ์ดแลนไร้สายแบบพีซีไอ พีซีเอ็มซีไอเอ เอกซ์เพรส ยูเอสบี รวมถึงเสาอากศแบบต่าง ๆ เพื่อแพร่กระจายคลื่นออกไปสำหรับการรับส่งข้อมูล
                </Text>
            </Box>
        </Container>
    )
}
