import { Flex, Container, Heading, Stack, Text, Button, Icon, IconProps, Grid, GridItem, Box, Spacer, Image } from "@chakra-ui/react"
import Chapter1 from "../components/chapter/image/pic1.jpg"
import { extendTheme } from "@chakra-ui/react"

export default function chapter1() {
    const spacing = {
        space: {
            px: "1px",
            0.5: "0.125rem",
            1: "0.25rem",
            1.5: "0.375rem",
            2: "0.5rem",
            2.5: "0.625rem",
            3: "0.75rem",
            3.5: "0.875rem",
            4: "1rem",
            5: "1.25rem",
            6: "1.5rem",
            7: "1.75rem",
            8: "2rem",
            9: "2.25rem",
            10: "2.5rem",
            12: "3rem",
            14: "3.5rem",
            16: "4rem",
            20: "5rem",
            24: "6rem",
            28: "7rem",
            32: "8rem",
            36: "9rem",
            40: "10rem",
            44: "11rem",
            48: "12rem",
            52: "13rem",
            56: "14rem",
            60: "15rem",
            64: "16rem",
            72: "18rem",
            80: "20rem",
            96: "24rem",
        },
    }
    const theme = extendTheme({ ...spacing })

    return (
        <Container maxW={"9xl"}>
            <Stack textAlign={"center"} align={"center"} spacing={{ base: 8, md: 10 }} py={{ base: 20, md: 28 }}>
                <Heading fontWeight={600} fontSize={{ base: "2xl", sm: "3xl", md: "4xl" }} lineHeight={"110%"}>
                    บทที่ 3 ประเภทของระบบเครือข่าย
                </Heading>
            </Stack>
            <Text fontSize={{ base: "3xl", sm: "1.5xl", md: "3xl" }} lineHeight={"110%"} color="black">
                3.1 เครือข่ายส่วนบุคคล (Personal Area Network)
            </Text>
            <Box gap={6} p={12}>
                <Text fontSize={"2xl"} color="#251B37">
                    หรือเรียกว่า “เครือข่ายแพน (PAN)” เป็นเครือข่ายคอมพิวเตอร์ที่เชื่อมต่อกัน โดยใช้เทคโนโลยีการติดต่อสื่อสารไร้สายขนาดเล็ก
                    ใช้ในการสื่อสารระยะใกล้ระหว่างอุปกรณ์อิเล็กทรอนิกส์ เช่น คอมพิวเตอร์แบบวางดักหรือแล็ปท็อป (Laptop)
                </Text>
                <Text fontSize={"2xl"} color="#251B37">
                    โดยพื้นฐานแล้วอุปกรณ์เหล่านี้จะไม่สามารถแลกเปลี่ยนข้อมูลซึ่งกันและกันได้
                    เพื่อสนับสนุนให้อุปกรณ์เหล่านี้มีความเท่าเทียมกันกับเครื่องคอมพิวเตอร์ส่วนบุคคลที่สามารถแลกเปลี่ยนข้อมูลระหว่างกันได้
                    เทคโนโลยีไร้สายที่นิยมใช้เครือข่ายส่วนบุคคล คือ บลูทูธ (Bluetooth) ซึ่งเป็นมาตรฐานที่สามารถใช้สร้างเครือข่ายไร้สาย
                    เครือข่ายส่วนบุคคล
                </Text>
                <Text fontSize={"2xl"} color="#251B37">
                    โดยใช้มาตรฐาน IEEE802.15.1 รองรับ เช่น
                    การเชื่อมต่อระหว่างคอมพิวเตอร์แบบวางดักหรือการเชื่อมต่อระหว่างพีดีเอกับโทรศัพท์เคลื่อนที่ส่วนบุคคล
                    เป็นการเชื่อมต่อโดยใช้คลื่นวิทยุที่เหมือนกับมาตรฐาน 802.11 ใช้ไฟฟ้าต่ำกว่า อุปกรณ์จึงมีขนาดเล็ก ส่งผลให้การรบกวนของคลื่นมีน้อยลง
                    มีระยะทางการใช้งานได้ไกลประมาณ 10 เมตร (30ฟุต) และทำงานที่ความเร็วประมาณ 700 กิโลบิตต่อวินาที
                </Text>
                <Heading fontSize={"3xl"} color="#251B37">
                    3.2 เครือข่ายท้องถิ่น (Local Area Network)
                </Heading>
                <Text fontSize={"2xl"} color="#251B37">
                    หรือเรียกว่า “เครือข่ายแลน (LAN)” ปัจจุบันมีความเร็วสูงถึง 100 หรือ 1000 เมกะบิตต่อวินาที
                    เป็นเครือข่ายคอมพิวเตอร์ที่ครอบคลุมพื้นที่เล็กๆ เป็นเครือข่ายที่สามารถติดตั้งได้บนพื้นที่ที่จำกัด เช่น ภายในห้องเดียวกัน
                    ภายในชั้นเดียวกัน หรือภายในอาคารเดียวกัน ทำให้คอมพิวเตอร์ทั้งหมดสามารถเข้าถึงเครื่องอื่นที่ต่ออยู่ในเครือข่าย
                    สามารถใช้ทรัพยากรต่างๆ ร่วมกันได้ เช่น เครื่องพิมพ์ โปรแกรมต่างๆ และไฟล์ข้อมูล ถ้าต้องการเชื่อมโยงเครือข่ายให้ไกลออกไป
                    ต้องใช้เครื่องทวนสัญญาณเพื่อยืดระยะทางการสื่อสารให้ไกลออกไป
                    โดยเครือข่ายแลนที่เชื่อมโยงในระยะทางที่ไกลต้องใช้สื่อกลางในการส่งข้อมูล คือ สายไฟเบอร์ออปติก เพื่อใช้เป็นแกนหลักหรือแบ็คโบน
                    (Backbone) และสามารถส่งได้ในอัตราความเร็วสูง เทคโนโลยีแลนมีหลายประเภท เช่น Ethernet, ATM, Token Ring, FDDI เป็นต้น
                    แต่ที่นิยมมากที่สุดในปัจจุบันคือ อีเธอร์เน็ต (Ethernet) อีเธอร์เน็ตจำแนกออกได้หลายประเภทย่อย ขึ้นอยู่กับความเร็ว ทอพอโลยี
                    และสายสัญญาณที่ใช้ เทคโนโลยีแลนแต่ละประเภทมีทั้งข้อดีและข้อเสียที่แตกต่างกัน
                    การเลือกใช้เทคโนโลยีนี้ควรให้เหมาะสมกับลักษณะการใช้งานเครือข่ายขององค์กร
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    1.อีเธอร์เน็ต (Ethernet)
                </Heading>
                <Text fontSize={"2xl"} color="#16213E">
                    ถูกคิดค้นตั้งแต่ทศวรรษ 1970 เป็นเทคโนโลยีชั้นนำของเครือข่ายท้องถิ่น อีเธอร์เน็ตตั้งอยู่บนมาตรฐานการส่งข้อมูลหรือโพรโทคอลCSMA/CD
                    (Carrier Sense Multiple Access with Collision Detection) ใช้สำหรับการเข้าใช้สื่อกลางการส่งสัญญาณที่แชร์กันระหว่างสถานีหรือโหนดต่าง
                    ๆ มีขั้นตอนคือ เมื่อโหนดใด ๆ ต้องการส่งข้อมูลต้องคอยฟังก่อนว่ามีโหนดอื่นกำลังส่งข้อมูลอยู่หรือไม่
                    ถ้ามีให้รอจนกว่าเครื่องนั้นจะทำการส่งข้อมูลเสร็จสิ้น แล้วค่อยเริ่มส่งข้อมูล และในขณะที่กำลังส่งข้อมูลนั้น
                    ต้องตรวจสอบว่ามีการชนกันของข้อมูลเกิดขึ้นหรือไม่ ถ้าเกิดการชนกันของข้อมูลให้หยุดการส่งข้อมูลทันที
                    แล้วเริ่มกระบวนการส่งข้อมูลใหม่อีกครั้ง อีเธอร์เน็ตจะใช้สื่อกลางร่วมกัน เรียกว่า บัส (Bus)
                    จึงมีโหนดที่ส่งข้อมูลได้แค่โหนดเดียวในขณะในขณะหนึ่ง
                    การชนกันของข้อมูลเกิดขึ้นเนื่องจากมีมากกว่าหนึ่งโหนดที่ทำการส่งข้อมูลบนสื่อกลางในเวลาเดียวกัน ข้อมูลจะเป็นขยะหรืออ่านไม่ได้
                    เมื่อมีจำนวนโหนดเพิ่มมากขึ้น ความน่าจะเป็นที่ข้อมูลชนกันจะเพิ่มขึ้นตามไปด้วย อีเธอร์เน็ตจะมีอัตราการส่งข้อมูลหรือแบนด์วิธที่ 10
                    Mbps ในขณะที่ฟาสต์อรเธอร์เน็ต (Fast Ethernet) มีการทำงานคล้าย ๆ กัน เพียงแค่มีอัตราข้อมูลที่สูงกว่า 10 เท่า ส่วนกิกะบิตอีเธอร์เน็ต
                    (Gigabit thernet) มีอตราข้อมูลสูงสุดคือ 1000 Mbps เรียกว่าเทนกิกะบิตอีเธอร์เน็ต (10G Ethernet)
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    2.โทเคนริง (Token Ring)
                </Heading>
                <Text fontSize={"2xl"} color="#16213E">
                    เป็นเครือข่ายที่มีการเชื่อมต่อเป็นวงแหวน เป็นเครือข่ายที่กำลังล้าสมัยเพราะมีการใช้น้อยลง
                    โทเคนริงมักนิยมใช้กันในสมัยแรกเนื่องจากมีข้อดีคือการส่งข้อมูลในเครือข่ายจะไม่มีการชนกันของข้อมูล
                    ข้อเสียคือความสามารถในการขยายเครือข่ายและการบริการจัดการเครือข่ายทำได้ยาก
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    3.เอทีเอ็ม (Asynchronous Transfer Mode: ATM)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    เป็นมาตรฐานการรับส่งข้อมูลที่กำหนดโดย ITU-T (Internaional Telecommuication Standard Sector) ซึ่งจะรวมบริการต่าง ๆ เช่น ข้อมูลเสียง
                    วิดีโอเข้าด้วยกันแล้วส่งเป็นเซลล์ (Cell) ข้อมูลมีขนาดเล็กและคงที่เป็นเครือข่ายที่รองรับแบนด์วิธตั้งแต่ Mbps จนถึง Gbps
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    4.เครือข่ายแลนไร้สาย (Wireless Local Area Network/ WLANs)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    เป็นเทคโนโลยีเครือข่ายแบบไร้สาย มีการนำระบบแลนไร้สาย ติดตั้งเพื่อให้บริการตั้งแต่องค์กรขนาดเล็กไปจนถึงขนาดใหญ่
                    เป็นการขยายการให้บริการเครือข่ายสัญญาณแบบเดิม และมีการใช้บริการอย่างแพร่หลาย โดยเฉพาะเครือข่ายแลนไร้สาย ซึ่งเป็นมาตรฐาน Wi-Fi
                    ดั้งนั้นผู้ผลิตอุปกรณ์คอมพิวเตอร์จึงได้ติดตั้งรวมเข้ากับอุปกรณ์ของผู้ใช้บริการ เช่น แล็ปท็อป แท็ปเล็ต สมาร์ตโฟน
                    เพื่ออำนวยความสะดวกในการใช้งานมากยิ่งขึ้น เครือข่ายแลนไร้สายประกอบด้วย IEEE 802.11
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    3.3 เครือข่ายระดับเมือง (Metropolitan Area Network)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    หรือเรียกว่า “เครือข่ายแมน (MAN)” เป็นเครือข่ายในเขตเมืองครอบคลุมพื้นที่เขตเมืองหรือในจังหวัดเดียวกัน
                    เป็นเครือข่ายคอมพิวเตอร์ที่มีขนาดใหญ่กว่าเครือข่ายท้องถิ่น เป็นการเชื่อมโยงคอมพิวเตอร์ขององค์กรเข้าด้วยกัน เช่น
                    การเชื่อมต่อคอมพิวเตอร์ของสาขาต่างๆ ในเขตเมืองหรือนครหลวง เพื่อสื่อสารและแบ่งปันข้อมูลระหว่างกันภายในองค์กร เช่น
                    เครือข่ายธนาคารแห่งประเทศไทย เครือข่ายการสื่อสารขององค์กรการโทรศัพท์
                </Text>
                <Heading fontSize={"3xl"} color="#16213E">
                    3.4 เครือข่ายระดับประเทศ (Wide Area Network)
                </Heading>
                <Text fontSize={"3xl"} color="#16213E">
                    หรือเรียกว่า “เครือข่ายแวน (WAN)” เป็นเครือข่ายคอมพิวเตอร์เกิดขึ้นจากการเชื่อมต่อแลนหลายๆ วงเข้าด้วยกัน
                    โดยเครือข่ายแวนที่เชื่อมต่อ ไม่จำกัดว่าจะเป็นองค์เดียวกันหรือไม่ การเชื่อมต่อบริเวณกว้างนั้น
                    จำเป็นต้องใช้อุปกรณ์เชื่อมต่อที่หลากหลาย เช่น ดาวเทียม คลื่นไมโครเวฟ หรือเส้นใยแก้วนำแสง เป็นต้น
                    ความเร็วในการเขื่อมต่อระยะไกลจะไม่เร็วเทียบเท่ากับความเร็วของแลนที่ใช้ในองค์กร
                    ดังนั้นความเร็วในการส่งข้อมูลอาจมีความเร็วประมาณหนึ่งหรือสองเมกะบิตต่อวินาที
                </Text>
                <Heading fontSize={"3xl"} color="#B30753">
                    สรุปสาระสำคัญ
                </Heading>
                <Text fontSize={"3xl"} color="#B30753">
                    ประเภทของเครือข่ายคอมพิวเตอร์มีการจำแนกตามขนาดพื้นที่หรือระยะทางที่เขื่อมต่อกัน ซึ่งแบ่งออกได้เป็น 4 ประเภท คือ
                    เครือข่ายส่วนบุคลเป็นเครือข่ายคอมพิวเตอร์ที่เชื่อมต่อกัน โดยใช้เทคโนโลยีการติดต่อสื่อสารไร้สายขนาดเล็ก
                    เพื่อใช้ในการสื่อสารระยะใกล้เครือข่ายท้องถิ่น เป็นเครือข่ายคอมพิวเตอร์ที่ครอบคลุมพื้นที่เล็กๆ
                    เป็นเครือข่ายที่สามารถติดตั้งได้บนพื้นที่ที่จำกัดเครือข่ายระดับเมือง
                    เป็นเครือข่ายในเขตเมืองครอบคลุมพื้นที่เบตเมืองหรือในจังหวัดเดียวกัน
                    และเครือข่ายระดับประเทศเป็นเครือข่ายคอมพิวเตอร์ที่เชื่อมต่อบริเวณกว้าง เช่น เครือข่ายอินเทอร์เน็ต เป็นต้น
                </Text>
            </Box>
        </Container>
    )
}
